package gr.aueb.cf.ch2;

public class TypecastApp {
    public static void main(String[] args) {
        int num1 = 10;
        long num2 = 20L;//Βαζουμε L για μετατροπη σε long καθως ολοι οι αριθμοι ειναι int
        long result = 0L;//Η μετατροπη γινεται κ χωρις L αλλα για λογους καλυτερης αποδοσης το κανουμε με L

        num1 = (int) num2; //num1=num2 θα ηταν λαθος γτ το long num2 64bit που δε χωραει στο 32bit int num1
                           //εφοσον δε χωραει το δεξι μερος στο αριστερο, την μετατροπη την κανουμε εμεις
                           // γιατι δε γινεται αυτοματα

        result = num1 + num2;//Ολα τα num,εφοσον διαφερουν,μετατρεπονται στο τυπο του μεγαλυτερου num δλδ εδω long
                              //Αρα σε τετοια περιπτωση οι μετατροπες γινονται αυτοματα
    }
}
